cases/defect-correction/laminarPlate/laminarPlate/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      4;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
   UComponents
   {
   	type components;
   	libs ("fieldFunctionObjects.so");
   	field U;
   	writeControl writeTime;
   }
   SampleLine
   {
   	type sets;
   	libs ("libsampling.so");
   	writeControl writeTime;
   	
   	setFormat csv;
   	interpolationScheme cellPoint;
   	
   	fields (Ux);
   	sets
   	(
   		LineY
   		{
   			type uniform;
   			axis distance;
   			start (1.00 0.00 0.05);
   			end (1.00 0.10 0.05);
   			nPoints 30;
   		}
   	);
   }
}



// ************************************************************************* //
