cases/defect-correction/laminarPlate/laminarPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       16615;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       16695;
    }
    topWall
    {
        type            patch;
        nFaces          105;
        startFace       16775;
    }
    symmetry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15;
        startFace       16880;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       16895;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16800;
        startFace       16985;
    }
)

// ************************************************************************* //
