cases/defect-correction/laminarPlate/laminarPlate/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            slip;
    }
    
    bottomWall
    {
        type 		noSlip;
    }
    
    symmetry
    {
        type            slip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
